# Телеграм

## Секретные чаты

В приложении для мобильных устройств можно создавать секретные чаты - диалоги с повышенным уровнем информационной безопасности. 

### Особенности секретных чатов

* При передачи сообщений в секретных чатах используется шифрование от устройства к устройству. 
* История такой переписки хранится не на серверах Телеграм, а на устройствах собеседников. Поэтому для ПК, где есть прямой доступ к корневому каталогу, секретный чат создать нельзя.
* Сообщения из секретного чата нельзя переслать другим пользователям.
* Невозможно сделать скриншот экрана. *Защита не работает, если собеседник использует стороннее приложение для создания скриншотов.*
* Сообщения и пересылаемые файлы можно удалить по таймеру, но его необходимо устанавливать перед отправкой сообщений. Когда собеседник просмотрит сообщение, запустится отсчёт назначенного времени. Сообщение будет удалено с обоих устройств.
* Секретные чаты удаляются, если пользователь выходит из своей учётной записи. 

### Шифрование


В шифровании сообщений обмен ключами проходит `по методу Диффи - Хеллмана`. Устройства, участвующие в секретном чате, обмениваются открытыми ключами (ОК), созданными по определенной формуле на основе закрытых ключей (СК), а затем вычисляют общий закрытый ключ, который используется при шифровании сообщений.

Наглядно алгоритм Диффи - Хеллмана можно представить так:
1. Устройство-1 отправляет Устройству-2 ключ “ОК+СК1”
2. Устройство-2 отправляет Устройству-1 ключ “ОК+СК2”
3. Затем устройства добавляют к полученному ключу свой и создают общий “ОК+СК1+СК2”.

Закрытый ключ не передается через канал связи и поэтому не может быть перехвачен.

Чтобы убедиться, что злоумышленники не получают зашифрованные сообщения, используйте функцию `Encryption key`. Сравните визуализированный ключ шифрования с ключом собеседника. Если изображения идентичны, перехват исключен.

Для того, чтобы обеспечить `прямую секретность`, не используйте один и тот же секретный чат в течение длительного времени. Удалите секретный чат и создайте новый, или выйдите из своей учётной записи (все секретные чаты удалятся), авторизуйтесь снова и создайте новые секретные чаты.

### Синхронизация

Поскольку история переписки в секретном чате не хранится на серверах Телеграм, синхронизация с другими устройствами и разными клиентами одного и того же пользователя невозможна. С другого устройства с тем же собеседником вы можете создать новый секретный чат. Количество новых секретных чатов не ограничено.

>### Примечание
>Несмотря на все уровни защиты, полную секретность переписки невозможно обеспечить, если у злоумышленника есть физический доступ к устройству одного из собеседников.
